HungChienSix/Renesas_SourceCode/模块参考资料/1.44寸128x128LCD-ZJY144KV-PG01技术资料/03-程序源码/03-程序源码/02-STM32例程/02-STM32_HAL库例程/01-STM32F103C8T6/HARDWARE/LCD/spi.h
#ifndef _SPI_H_
#define _SPI_H_

#include "stm32f1xx.h"

/* 定义管脚端口 */
#define LCD_SCK_CLK_ENABLE() __HAL_RCC_GPIOA_CLK_ENABLE()
#define LCD_SCK_GPIO_PORT GPIOA
#define LCD_SCK_GPIO_PIN GPIO_PIN_0

#define LCD_MOSI_CLK_ENABLE() __HAL_RCC_GPIOA_CLK_ENABLE()
#define LCD_MOSI_GPIO_PORT GPIOA
#define LCD_MOSI_GPIO_PIN GPIO_PIN_1

#define LCD_RES_CLK_ENABLE() __HAL_RCC_GPIOA_CLK_ENABLE()
#define LCD_RES_GPIO_PORT GPIOA
#define LCD_RES_GPIO_PIN GPIO_PIN_2

#define LCD_DC_CLK_ENABLE() __HAL_RCC_GPIOA_CLK_ENABLE()
#define LCD_DC_GPIO_PORT GPIOA
#define LCD_DC_GPIO_PIN GPIO_PIN_3

#define LCD_CS_CLK_ENABLE() __HAL_RCC_GPIOA_CLK_ENABLE()
#define LCD_CS_GPIO_PORT GPIOA
#define LCD_CS_GPIO_PIN GPIO_PIN_4

#define LCD_BLK_CLK_ENABLE() __HAL_RCC_GPIOA_CLK_ENABLE()
#define LCD_BLK_GPIO_PORT GPIOA
#define LCD_BLK_GPIO_PIN GPIO_PIN_5

/* 定义端口电平状态 */
#define LCD_SCK_Clr() HAL_GPIO_WritePin(LCD_SCK_GPIO_PORT, LCD_SCK_GPIO_PIN, GPIO_PIN_RESET)
#define LCD_SCK_Set() HAL_GPIO_WritePin(LCD_SCK_GPIO_PORT, LCD_SCK_GPIO_PIN, GPIO_PIN_SET)

#define LCD_MOSI_Clr() HAL_GPIO_WritePin(LCD_MOSI_GPIO_PORT, LCD_MOSI_GPIO_PIN, GPIO_PIN_RESET)
#define LCD_MOSI_Set() HAL_GPIO_WritePin(LCD_MOSI_GPIO_PORT, LCD_MOSI_GPIO_PIN, GPIO_PIN_SET)

#define LCD_RES_Clr() HAL_GPIO_WritePin(LCD_RES_GPIO_PORT, LCD_RES_GPIO_PIN, GPIO_PIN_RESET)
#define LCD_RES_Set() HAL_GPIO_WritePin(LCD_RES_GPIO_PORT, LCD_RES_GPIO_PIN, GPIO_PIN_SET)

#define LCD_DC_Clr() HAL_GPIO_WritePin(LCD_DC_GPIO_PORT, LCD_DC_GPIO_PIN, GPIO_PIN_RESET)
#define LCD_DC_Set() HAL_GPIO_WritePin(LCD_DC_GPIO_PORT, LCD_DC_GPIO_PIN, GPIO_PIN_SET)

#define LCD_CS_Clr() HAL_GPIO_WritePin(LCD_CS_GPIO_PORT, LCD_CS_GPIO_PIN, GPIO_PIN_RESET)
#define LCD_CS_Set() HAL_GPIO_WritePin(LCD_CS_GPIO_PORT, LCD_CS_GPIO_PIN, GPIO_PIN_SET)

#define LCD_BLK_Clr() HAL_GPIO_WritePin(LCD_BLK_GPIO_PORT, LCD_BLK_GPIO_PIN, GPIO_PIN_RESET)
#define LCD_BLK_Set() HAL_GPIO_WritePin(LCD_BLK_GPIO_PORT, LCD_BLK_GPIO_PIN, GPIO_PIN_SET)

/* 函数声明 */
void LCD_GPIOInit(void);
void LCD_WR_Bus(uint8_t dat);
void LCD_WR_REG(uint8_t reg);
void LCD_WR_DATA8(uint8_t dat);
void LCD_WR_DATA(uint16_t dat);

#endif
